In [2]:
import mysql.connector as connection
import pandas as pd

In [7]:
mydb = connection.connect(host="localhost", database = 'chinook',user="chinook", passwd="p4ssw0rd",use_pure=True)

In [11]:
query="select distinct e.LastName,e.FirstName"
query=query+",c.Name TrackName"
query=query+",d.Title"
query=query+" from Invoice a"
query=query+" join InvoiceLine b on a.InvoiceId=b.InvoiceId"
query=query+" join Track c on b.TrackId=c.TrackId"
query=query+" join Album d on c.AlbumId=d.AlbumId"
query=query+" join Customer e on a.CustomerId=e.CustomerId"
query=query+" order by e.LastName,e.FirstName"
result_dataFrame = pd.read_sql(query,mydb)
result_dataFrame.head()

,LastName,FirstName,TrackName,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas